def bmi (kg,m) :
    res = kg/(m/100)**2
    return res

def checkbmi(bmi):
    if bmi < 18.5 :
        print("อยู่ในเกณฑ์: น้ำหนักน้อย / ผอม ภาวะเสี่ยงต่อโรค: มากกว่าคนปกติ")
    elif bmi >= 18.5 and bmi <= 22.9 :
        print("อยู่ในเกณฑ์: ปกติ (สุขภาพดี) ภาวะเสี่ยงต่อโรค: เท่าคนปกติ")
    elif bmi >= 23 and bmi <= 24.9 :
        print("อยู่ในเกณฑ์: ท้วม / โรคอ้วนระดับ 1 ภาวะเสี่ยงต่อโรค: อันตรายระดับ 1")
    elif bmi >= 25 and bmi <= 29.9 :
        print("อยู่ในเกณฑ์: อ้วน / โรคอ้วนระดับ 2 ภาวะเสี่ยงต่อโรค: อันตรายระดับ 2")
    elif bmi > 30 :
        print("อยู่ในเกณฑ์: อ้วนมาก / โรคอ้วนระดับ 3 ภาวะเสี่ยงต่อโรค: อันตรายระดับ 3")
    
i = float(input("ป้อนค่าน้ำหนัก kg: "))
x = float(input("ป้อนส่วนสูง cm: "))
        
print("ค่า BMI คุณคือ : %.2f" % bmi(i,x))
checkbmi(bmi(i,x))